shubhamdp/connectedhomeip/src/platform/ESP32/ConnectivityManagerImpl_WiFi.cpp
    // TODO: check for protocol type as well

    WiFiPAFSession sessionInfo  = { .id = TxInfo.id };
    WiFiPAFLayer & WiFiPafLayer = WiFiPAFLayer::GetWiFiPAFLayer();
    auto pPafInfo               = WiFiPafLayer.GetPAFInfo(PafInfoAccess::kAccSessionId, sessionInfo);
    if (pPafInfo == nullptr)
    {
        ChipLogError(DeviceLayer, "connectivitymanagerimpl_wifi -- OnNanReplied, no valid session with publish_id: %" PRIu32,
                     TxInfo.id);
        return;
    }

    if ((pPafInfo->role == WiFiPAF::WiFiPafRole::kWiFiPafRole_Publisher) && (pPafInfo->peer_id == TxInfo.peer_id) &&
        !memcmp(pPafInfo->peer_addr, TxInfo.peer_addr, sizeof(uint8_t) * 6))
    {
        ChipLogError(DeviceLayer, "connectivitymanagerimpl_wifi -- OnNanReplied, reentrance, publish_id: %" PRIu32, TxInfo.id);
        return;
    }

    ChipLogProgress(DeviceLayer, "WiFi-PAF: OnReplied, set PafInfo, whose nodeId: 0x" ChipLogFormatX64,
                    ChipLogValueX64(pPafInfo->nodeId));
    ChipLogProgress(DeviceLayer, "\t (publish_id, peer_subscribe_id): (%" PRIu32 ", %" PRIu32 ")", TxInfo.id, TxInfo.peer_id);
    ChipLogProgress(DeviceLayer, "\t peer_addr: [%02x:%02x:%02x:%02x:%02x:%02x]", TxInfo.peer_addr[0], TxInfo.peer_addr[1],
                    TxInfo.peer_addr[2], TxInfo.peer_addr[3], TxInfo.peer_addr[4], TxInfo.peer_addr[5]);
    ChipLogProgress(DeviceLayer, "\t DevInfo: %x", pPublishSSI->DevInfo);

    pPafInfo->role    = WiFiPAF::WiFiPafRole::kWiFiPafRole_Publisher;
    pPafInfo->id      = TxInfo.id;
    pPafInfo->peer_id = TxInfo.peer_id;
    memcpy(pPafInfo->peer_addr, TxInfo.peer_addr, sizeof(uint8_t) * 6);

    CHIP_ERROR err = WiFiPafLayer.HandleTransportConnectionInitiated(*pPafInfo);
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "connectivitymanagerimpl_wifi -- OnNanReplied, HandleTransportConnectionInitiated() failed: %s",
                     chip::ErrorStr(err));
    }

    printf("connectivitymanagerimpl_wifi -- OnNanReplied, done\n");
}

#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFIPAF

void ConnectivityManagerImpl::OnWiFiPlatformEvent(const ChipDeviceEvent * event)
{
    // printf("connectivitymanagerimpl_wifi -- OnWiFiPlatformEvent\n");
    // Handle ESP system events...
    if (event->Type == DeviceEventType::kESPSystemEvent)
    {
        // printf("connectivitymanagerimpl_wifi -- kESPSystemEvent\n");
        if (event->Platform.ESPSystemEvent.Base == WIFI_EVENT)
        {
            // printf("connectivitymanagerimpl_wifi -- WIFI_EVENT\n");
            switch (event->Platform.ESPSystemEvent.Id)
            {
            case WIFI_EVENT_SCAN_DONE:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_SCAN_DONE");
                NetworkCommissioning::ESPWiFiDriver::GetInstance().OnScanWiFiNetworkDone();
                break;
            case WIFI_EVENT_STA_START:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_STA_START");
                // DriveStationState();
                break;
            case WIFI_EVENT_STA_CONNECTED:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_STA_CONNECTED");
                if (mWiFiStationState == kWiFiStationState_Connecting)
                {
                    ChangeWiFiStationState(kWiFiStationState_Connecting_Succeeded);
                }
                DriveStationState();
                break;
            case WIFI_EVENT_STA_DISCONNECTED:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_STA_DISCONNECTED");
                TEMPORARY_RETURN_IGNORED NetworkCommissioning::ESPWiFiDriver::GetInstance().SetLastDisconnectReason(event);
                if (mWiFiStationState == kWiFiStationState_Connecting)
                {
                    ChangeWiFiStationState(kWiFiStationState_Connecting_Failed);
                }
                DriveStationState();
                break;
            case WIFI_EVENT_STA_STOP:
                ChipLogProgress(DeviceLayer, "WIFI_EVENT_STA_STOP");
                DriveStationState();
                break;

#if CHIP_DEVICE_CONFIG_ENABLE_WIFIPAF
            case WIFI_EVENT_NAN_RECEIVE: {
                ChipLogProgress(DeviceLayer, "connectivitymanagerimpl_wifi -- got an event WIFI_EVENT_NAN_RECEIVE");
                OnNanReceive(event->Platform.ESPSystemEvent.Data.WiFiNanReceive.nanReceive,
                             event->Platform.ESPSystemEvent.Data.WiFiNanReceive.ssi);
                break;
            }
            case WIFI_EVENT_NAN_REPLIED: {
                ChipLogProgress(DeviceLayer, "connectivitymanagerimpl_wifi -- got an event WIFI_EVENT_NAN_REPLIED");
                OnNanReplied(event->Platform.ESPSystemEvent.Data.WiFiNanReplied);
                break;
            }
#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFIPAF

            default:
                break;
            }
        }

        if (event->Platform.ESPSystemEvent.Base == IP_EVENT)
        {
            switch (event->Platform.ESPSystemEvent.Id)
            {
            case IP_EVENT_STA_GOT_IP:
                ChipLogProgress(DeviceLayer, "IP_EVENT_STA_GOT_IP");
                OnStationIPv4AddressAvailable(event->Platform.ESPSystemEvent.Data.IpGotIp);
                break;
            case IP_EVENT_STA_LOST_IP:
                ChipLogProgress(DeviceLayer, "IP_EVENT_STA_LOST_IP");
                OnStationIPv4AddressLost();
                break;
            case IP_EVENT_GOT_IP6:
                ChipLogProgress(DeviceLayer, "IP_EVENT_GOT_IP6");
                if (strcmp(esp_netif_get_ifkey(event->Platform.ESPSystemEvent.Data.IpGotIp6.esp_netif),
                           ESP32Utils::kDefaultWiFiStationNetifKey) == 0)
                {
                    OnStationIPv6AddressAvailable(event->Platform.ESPSystemEvent.Data.IpGotIp6);
                }
                break;
            default:
                break;
            }
        }
    }
    if (event->Type == DeviceEventType::kCHIPoWiFiPAFWriteDone)
    {
        ChipLogProgress(DeviceLayer, "WiFi-PAF: event: kCHIPoWiFiPAFWriteDone, result: %d", event->CHIPoWiFiPAFReceived.result);
        WiFiPAF::WiFiPAFSession TxInfo;
        memcpy(&TxInfo, &event->CHIPoWiFiPAFReceived.SessionInfo, sizeof(WiFiPAF::WiFiPAFSession));
        WiFiPAF::WiFiPAFLayer::GetWiFiPAFLayer().HandleWriteConfirmed(TxInfo, event->CHIPoWiFiPAFReceived.result);
    }
}

void ConnectivityManagerImpl::_OnWiFiScanDone()
{
    // Schedule a call to DriveStationState method in case a station connect attempt was
    // deferred because the scan was in progress.
    TEMPORARY_RETURN_IGNORED DeviceLayer::SystemLayer().ScheduleWork(DriveStationState, NULL);
}

void ConnectivityManagerImpl::_OnWiFiStationProvisionChange()
{
    // Schedule a call to the DriveStationState method to adjust the station state as needed.
    TEMPORARY_RETURN_IGNORED DeviceLayer::SystemLayer().ScheduleWork(DriveStationState, NULL);
}

void ConnectivityManagerImpl::DriveStationState()
{
    bool stationConnected;

    // Refresh the current station mode.  Specifically, this reads the ESP auto_connect flag,
    // which determine whether the WiFi station mode is kWiFiStationMode_Enabled or
    // kWiFiStationMode_Disabled.
    GetWiFiStationMode();

